In [67]:
import numpy as np
import pandas as pd

In [68]:
df1 = pd.DataFrame({
    'name': ['rahul', 'vidu', 'vishnu', 'paru'],
    "age": [22, 21, 10, 19],
    "marks": [90, 87, 30, 67]
})

df1
df1.index
df1.columns

     name  age  marks
0   rahul   22     90
1    vidu   21     87
2  vishnu   10     30
3    paru   19     67

RangeIndex(start=0, stop=4, step=1)

Index(['name', 'age', 'marks'], dtype='object')

In [69]:
df2 = df1.copy()

In [70]:
df1.compare(df2)  # Empty dataframe not visible by notebook display

Empty DataFrame
Columns: []
Index: []

In [71]:
c = df1.compare(df2)
print(c)
type(c)
len(c)

Empty DataFrame
Columns: []
Index: []

pandas.core.frame.DataFrame

0

In [72]:
df3 = df1.copy()
df3.loc[0, 'age'] = 25
df3.loc[2, 'age'] = 26
df3.loc[2, 'marks'] = 100

In [77]:
c = df1.compare(df3)
c

    age       marks
   self other  self  other
0  22.0  25.0   NaN    NaN
2  10.0  26.0  30.0  100.0

In [78]:
c.index
c.columns

Index([0, 2], dtype='int64')

MultiIndex([(  'age',  'self'),
            (  'age', 'other'),
            ('marks',  'self'),
            ('marks', 'other')],
           )

In [75]:
c = df1.compare(df3, align_axis=0)
c

          age  marks
0 self   22.0    NaN
  other  25.0    NaN
2 self   10.0   30.0
  other  26.0  100.0

In [76]:
c.index
c.columns

MultiIndex([(0,  'self'),
            (0, 'other'),
            (2,  'self'),
            (2, 'other')],
           )

Index(['age', 'marks'], dtype='object')